package week23;

public class Length {
    public static void main(String[] args) {
        String len = "저는 SSAFY의 프로젝트 기반 교육을 통해 AI를 활용한 실무 경험을 쌓고 개발 역량을 강화하여, AI 개발 역량을 갖춘 백엔드 개발자로 성장하고자 지원했습니다.\n" +
                "백엔드 개발 역량을 쌓기 위해 “멋쟁이사자처럼 백엔드 부트캠프”에 참여해 Java·Spring 기반 기술을 학습하고, 2개월간 팀 프로젝트에서 “모멘트리 사진 블로그”와 “헬스쿨 E-LMS 플랫폼”을 개발하며 기획부터 배포까지 경험했습니다. 팀장으로 참여해 협업과 프로젝트 운영 능력을 키웠으며, 이후 인턴십에서 “매칭핏 AI 이력서 매칭 플랫폼” 개발에 참여하며 실무적인 AI·백엔드 개발 경험을 쌓았습니다.\n" +
                "JWT·OAuth2 기반 인증/인가, Mail API, WebSocket STOMP, OpenAI API 등 새로운 기술들을 실제 개발 과정에서 경험하며 서비스 기능을 확장했습니다. 또한 Terraform을 활용해 그린/블루 방식의 무중단 배포 환경도 구축했습니다..\n" +
                "하지만 대용량 트래픽 기반의 서비스 운영 경험과 전문적인 AI 기술 역량이 부족하다고 느꼈습니다. 그래서 SSAFY를 통해 다양한 사람들과 협업하며, 단순히 개발에 그치지 않고, AI 기술을 접목시킨 대용량 트래픽 기반의 서비스를 개발해보고 싶어 지원하게 되었습니다.\n\n";
        System.out.println(len.length());

    }
}
