package week23;

public class Length {
    public static void main(String[] args) {
        String len = "Java와 Spring Boot 기반 백엔드 개발 경험과 AI 관련 전공 지식을 중심으로 클라우드 환경에서 서비스를 개발하고 배포해 안정적인 서버 운영을 경험했습니다. 그리고 KTCloud의 SW 개발 분야를 위해 3가지 역량을 갖추어 왔습니다. \n" +
                "첫째, “인공지능응용” 과목을 통해 인공지능에 대한 핵심 개념을 배우고 데이터를 활용한 모델 구현과 성능 분석 방법을 익혔습니다. 이 지식들은 데이터 기반 설계와 분석에 적용 가능합니다.\n" +
                "둘째, Health-School 프로젝트에서 대시보드 CRUD, JWT 인증·권한 관리, STOMP 기반 실시간 상담 기능을 구현해 고객 맞춤 환경과 실시간 소통 서버를 제공한 경험이 있습니다. 이를 통해 대규모 웹 서비스에서도 요구사항에 맞는 아키텍처와 확장 가능한 서버 설계에 활용 가능합니다.\n" +
                "셋째, AWS EC2와 Docker로 환경을 컨테이너화하고 Terraform으로 인프라를 코드(IaC)로 관리했습니다. 그리고 CI/CD로 빌드와 배포를 자동화하고, 블루/그린 전략으로 무중단 배포 환경을 구성했습니다. 이 과정에서 배포 오류를 사전에 방지했으며, 운영 효율성과 서비스 안정성을 높였습니다. 이러한 경험은 클라우드 환경에서 안정적인 서비스 운영과 최적화된 배포 체계 설계에 활용할 수 있습니다.\n" +
                "이를 통해 제 역량이 안정적이고 효율적인 클라우드와 AI 서비스 운영에 활용될 수 있을 것입니다.\n";
        System.out.println(len.length());

    }
}
