package week23;

public class Length {
    public static void main(String[] args) {
        String len = "고등학교 시절부터 프로그래밍에 흥미를 가져 대학에서 컴퓨터학부 정보통신공학을 전공하게 되었습니다. 학부 과정에서 데이터베이스, 자료구조, 네트워크, 알고리즘 등 과목을 학습하여 시스템과 프로그램의 구조를 이해했고, 이를 바탕으로 간단한 게시판을 만들어 보며 웹 개발에 관심을 가지게 되었습니다.\n" +
                "멋쟁이사자처럼 교육과 인턴십에 참여하여 백엔드를 담당해 프로젝트를 진행했고, Java와 Spring을 활용해 서버 로직과 데이터베이스를 구현하며 실무 경험을 쌓았습니다. 또한 팀원들과 협업하며 일정 관리와 역할 분담, 문제 해결 과정을 경험하며 책임감을 키웠습니다. 이러한 과정을 통해 기술적 역량뿐 아니라 협업과 문제 해결력을 함께 발전시켜, 안정적이고 효율적인 서비스를 구현할 수 있는 개발자로 성장하고 있습니다.\n";
        System.out.println(len.length());

    }
}
