package week23;

public class Length {
    public static void main(String[] args) {
        String len = "보험 IT 시스템의 복잡성과 무거운 구조적 한계를 개선하고, 클라우드 기반으로 빠르게 대응할 수 있는 차별화된 플랫폼에 매력을 느껴 DB Inc.에 지원하게 되었습니다.\n" +
                "어머님이 보험 쪽에 종사하고 계셔서 자연스럽게 보험 계열사에 관심을 가지게 되었습니다. 이를 계기로 보험 IT 시스템이 어떤 역할을 하는지 탐구하는 중, DB Inc.에서 개발 중인 보험 특화 클라우드 플랫폼 ‘예스슈어(Yes, Sure)’를 알게 되었습니다.\n" +
                "보험 IT 시스템은 계약, 청구, 보상 등 복잡한 데이터 처리와 높은 안정성을 요구하는 특성이 있는데, 기존 시스템은 이러한 요구를 충족하는 과정에서 무겁고 유지보수가 어렵다는 한계가 있었습니다. 그러나 예스슈어는 클라우드 기반으로 경량화되고 변화에 빠르게 대응할 수 있는 차별화된 플랫폼으로, 백엔드 웹 개발자로서 데이터 처리, API 설계, 안정적인 서비스 운영 경험을 쌓을 수 있음에 매력을 느끼게 되었습니다.\n" +
                "단기적으로는 DB그룹 S/W 엔지니어로서 예스슈어 개발에 참여하여 안정적이고 확장 가능한 보험 플랫폼 구축, 백엔드 개발 역량 강화, API 설계와 실무 경험 축적에 집중하고자 합니다.\n" +
                "장기적으로는 클라우드 기반 시스템 설계와 서비스 운영 경험을 바탕으로 사용자 맞춤형 기능과 안정적인 플랫폼 개발에 기여하며 전문성을 갖춘 백엔드 엔지니어로 성장하고 싶습니다.\n";
        System.out.println(len.length());

    }
}
