package week23;

public class Length {
    public static void main(String[] args) {
        String len = "가장 의미 있었던 경험은 멋쟁이사자처럼 교육과정에서 2차 프로젝트로 진행한 “헬스쿨 E-LMS 플랫폼” 개발입니다. 이 프로젝트는 실제 사용자가 이용하는 서비스를 안정적이고 효율적으로 운영하는 것을 목표로 진행되었으며, 백엔드 개발 팀원으로 참여하여 핵심 기능과 실시간 기능을 구현하고, 실제 운영 환경에서 안정적인 서비스 제공을 달성했습니다.\n" +
                "유저와 트레이너 대시보드 기능을 전담하고, 개인 운동 기록 CRUD, 구매 내역 조회, 상담 관리 등 핵심 기능을 구현했습니다. 특히 WebSocket과 STOMP를 활용한 실시간 1:1 채팅 기능을 구축하고, 사용자별 맞춤 서비스를 안정적으로 제공할 수 있도록 개발했습니다. \n" +
                "또한 무중단 배포 환경을 적용해 기능 개선과 배포 과정에서도 서비스가 중단되지 않도록 관리함으로써 실제 운영 환경에서 안정적인 서비스를 제공할 수 있었습니다.\n" +
                "이 경험을 통해 규모 있는 서비스에서 발생할 수 있는 성능 문제와 안정성 문제를 예측하고 대응할 수 있는 능력을 키울 수 있었습니다. 또한 프로젝트를 마친 후 팀원과 협업하며 문제를 해결하고 서비스를 완성하는 과정에서 실무적 경험과 안정적인 서비스 운영 역량을 동시에 강화할 수 있었습니다.\n";
        System.out.println(len.length());

    }
}
